[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics Project",
    "description": "Welcome to our new blog, Visual Analytics Project. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Choong Shi Lian Selene,Jiang Weiling Angeline, Wong Wei Sheng Dylan",
        "url": {}
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-25T21:26:20+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-25-proposal/",
    "title": "Proposal",
    "description": "Exploratory analysis of greenhouse gas emissions and Panel data regression for investigating the determinants of greenhouse gas emissions for European Union countries",
    "author": [
      {
        "name": "Group 2 (Angeline Jiang, Dylan Wong, Selene Choong)",
        "url": {}
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nBackground\r\nMotivation\r\nProject Objectives\r\nBroad Data Description\r\nProposed Scope and Methodology\r\nStoryboard & Visualization Features\r\n(A) Exploratory Data Analysis (EDA) methods in R\r\n(B) Analysis of Panel data regression (using plm package) in R\r\n(C) Development of validating checks and model selection in R\r\nProposed R Packages\r\nTeam Members\r\nReferences\r\n\r\n\r\nh1, h2, h3 {\r\ntext-align: left\r\n}\r\nbody {\r\ntext-align: justify}\r\nBackground\r\nGlobal warming is expected to result in a rise of the average global temperature between 1.1 to 6.4 degree celsius over the century, if there are no interventions taken to reduce emissions of greenhouse gases. Greenhouse gases are contributed by multiple drivers which include economic activities such as electricity production, transportation and waste generation. Carbon dioxide is the primary greenhouse gas emitted through human activities.\r\nIn December 2020, the European Union (EU) leaders committed to an ambitious goal of reducing greenhouse gases by 55% by 2030 to tackle climate change. The EU is currently the world’s third biggest emitter of greenhouse gases. Measures, such as emission taxes and use of renewable energy sources, were introduced to mitigate the greenhouse gas emissions, especially carbon dioxide emissions.\r\nMotivation\r\nA large amount of climate change related statistics are available on Eurostat, with data across multiple domains such as environmental, social and economic statistics. Monitoring of the reduction of greenhouse gas emissions can be performed and is essential for tracking EU’s progress towards achieving its 2030 goal. Analysis of the impacts of the drivers and mitigation using the available statistics also allowed for insights on the determinants of the greenhouse gas emissions for the EU countries.\r\nProject Objectives\r\nThe project aims to deliver an R-Shiny app that provides interactive user interface design to:\r\nUnderstand the correlation of factors affecting greenhouse gas emissions\r\nIdentify important factors which contributes to greenhouse gas emissions using Panel data regression\r\nFurther analyse the difference in greenhouse gas emissions by country and time period\r\nBroad Data Description\r\nStatistics from Eurostat covering a wide range of domains are used in this R Shiny Application. For our project, we will focus on datasets under greenhouse gas emissions (specifically carbon dioxide emissions), drivers and mitigation for all EU countries.\r\nProposed Scope and Methodology\r\nAnalysis of Eurostat greenhouse emission dataset with background research\r\nExploratory Data Analysis (EDA) methods in R\r\nAnalysis of Panel data regression (using plm package) in R\r\nDevelopment of validating checks and model selection in R\r\nR-Shiny app development for user interactivity\r\nA generalized development timeframe for this project is shown below:\r\n\r\n\r\n\r\nStoryboard & Visualization Features\r\n(A) Exploratory Data Analysis (EDA) methods in R\r\nThe proposed layout of the R Shiny app consists of 3 tab panels\r\n\r\nUnder the EDA tab, there will be another tab panel comprising of 4 tabs shown below:\r\nData\r\nProposed Visualisation\r\nGreenhouse Gases Emission\r\n\r\nGreen Energy Production\r\n\r\nCorrelation Plot of Drivers\r\n\r\nScatter Plot for Drivers and Mitigation\r\n\r\n(B) Analysis of Panel data regression (using plm package) in R\r\n\r\n\r\n\r\nIf user(s) prefers to see in terms of bar chart i.e. “Bar” is selected under the View option.\r\n\r\n\r\n\r\n(C) Development of validating checks and model selection in R\r\nTo cater to varying statistical knowledge of users, there will be two types of outputs shown - (1) simplified overview of whether the assumptions for the calibrated model is met and (2) detailed outputs from each validation tests.\r\n\r\n\r\n\r\nThe list of validation tests for the panel models include:\r\nTest of poolability using Chow test\r\nTests for individual and time effects using Lagrange multiplier test\r\nTest for correlation between unobserved effects and the regressors using Hausman-type test\r\nTest for stationarity of the series using Augmented Dickey-Fuller (ADF)\r\nTest for cross-sectional dependence using the Pesaran CD test of independence\r\nProposed R Packages\r\nData Preparation\r\ntidyverse: https://www.tidyverse.org\r\nPanel data regression\r\nExPanDaR: https://cran.r-project.org/web/packages/ExPanDaR\r\nplm: https://cran.r-project.org/web/packages/plm\r\nstargazer: https://cran.r-project.org/web/packages/stargazer\r\ntseries: https://cran.r-project.org/web/packages/tseries\r\nBuilding Shiny App\r\nshiny: https://shiny.rstudio.com\r\nshinythemes: https://cran.r-project.org/web/packages/shinythemes\r\nshinyWidgets: https://cran.r-project.org/web/packages/shinyWidgets\r\nRColorBrewer: https://cran.r-project.org/web/packages/RColorBrewer\r\nTeam Members\r\nChoong Shi Lian Selene\r\nJiang Weiling Angeline\r\nWong Wei Sheng Dylan\r\nReferences\r\nClimate change: EU leaders set 55% target for CO2 emissions cut\r\nCombating climate change: Fact sheet\r\nOverview of Greenhouse Cases: Carbon Dioxide\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-25-proposal/./image/timeline.png",
    "last_modified": "2021-02-28T18:49:22+08:00",
    "input_file": "proposal.utf8.md"
  }
]
